import React from "react";
import LoginSection from "../../components/Auth/Login";
import MetaComponent from "@/components/common/MetaComponent";
const metadata = {
  title: "Syria Souq | تسجيل الدخول",
  description: "ابحث عن أفضل عروض العقارات والسيارات للبيع وللإيجار في سوريا",
  keywords:
    "سوق, سوريا, إعلانات, بيع, شراء, مستعمل, جديد, سيارات, عقارات, أراضي, دراجات, موتورات, قوارب, سيارات مستعملة, سيارات للبيع, سيارات جديدة, أسعار السيارات, سوق السيارات, سيارات دمشق, سيارات حلب, سيارات حمص, سيارات اللاذقية, عقارات, شقق, شقق للبيع, شقق للإيجار, فلل, منازل, بيوت, أسعار العقارات, عقارات دمشق, عقارات حلب, عقارات حمص, عقارات اللاذقية, أراضي, أرض للبيع, شراء أرض, أسعار الأراضي, سوق الأراضي, أراضي دمشق, أراضي حلب, أراضي حمص, أراضي اللاذقية, قوارب, يخوت, قوارب مستعملة, قوارب جديدة, زوارق, سوق القوارب, قوارب صيد, قوارب دمشق, قوارب حلب, قوارب حمص, قوارب اللاذقية, دراجات, موتورات, دراجات مستعملة, دراجات للبيع, سوق الدراجات, دراجات دمشق, دراجات حلب, دراجات حمص, دراجات اللاذقية",
};

export default function LoginPage() {
  return (
    <div className="position-relative">
      <MetaComponent meta={metadata} />
      <LoginSection />
    </div>
  );
}
